In [1]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
titanic_data = pd.read_csv("../artifacts/train.csv")

In [3]:
titanic_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80,0,0,27042,30.0000,A23,S
1,861,0,3,"Hansen, Mr. Claus Peter",male,41,2,0,350026,14.1083,NaN,S
2,158,0,3,"Corn, Mr. Harry",male,30,0,0,SOTON/OQ 392090,8.0500,NaN,S
3,330,1,1,"Hippach, Miss. Jean Gertrude",female,16,0,1,111361,57.9792,B18,C
4,145,0,2,"Andrew, Mr. Edgardo Samuel",male,18,0,0,231945,11.5000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
566,119,0,1,"Baxter, Mr. Quigg Edmond",male,24,0,1,PC 17558,247.5208,B58 B60,C
567,748,1,2,"Sinkkonen, Miss. Anna",female,30,0,0,250648,13.0000,NaN,S
568,13,0,3,"Saundercock, Mr. William Henry",male,20,0,0,A/5. 2151,8.0500,NaN,S
569,436,1,1,"Carter, Miss. Lucile Polk",female,14,1,2,113760,120.0000,B96 B98,S
570,183,0,3,"Asplund, Master. Clarence Gustaf Hugo",male,9,4,2,347077,31.3875,NaN,S

In [4]:
titanic_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,571.000000,571.000000,571.000000,571.000000,571.000000,571.000000,571.000000
mean,446.971979,0.406305,2.236427,29.267951,0.537653,0.448336,35.204071
std,260.702168,0.491573,0.838840,14.636293,0.951398,0.877822,52.756659
min,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000
25%,217.000000,0.000000,1.000000,20.000000,0.000000,0.000000,8.050000
50%,446.000000,0.000000,2.000000,28.000000,0.000000,0.000000,15.850000
75%,677.500000,1.000000,3.000000,38.000000,1.000000,1.000000,34.514600
max,890.000000,1.000000,3.000000,80.000000,5.000000,6.000000,512.329200

In [5]:
import seaborn as sns

In [16]:
sns.heatmap(titanic_data.corr(),cmap="YlGnBl",numeric_only=True)
plt.show()

ValueError: could not convert string to float: 'Barkworth, Mr. Algernon Henry Wilson'